Repository: nguyenhv01012000/PetShop_backend
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: vi

source: Invalid basic header. No credentials provided.
vi: Sai header cơ bản. Thông tin đăng nhập không được cung cấp

source: Invalid basic header. Credentials string should not contain spaces.
vi: Sai header cơ bản. Chuỗi xác thực không được chứa khoảng trắng

source: Invalid basic header. Credentials not correctly base64 encoded.
vi: Sai header cơ bản. Chuỗi xác thực không được mã hóa base64

source: Invalid username/password.
vi: Sai tên người dùng/mật khẩu

source: User inactive or deleted.
vi: Người dùng đã bị khóa hoặc bị xóa

source: Invalid token header. No credentials provided.
vi: Sai token header. Thông tin đăng nhập không được cung cấp

source: Invalid token header. Token string should not contain spaces.
vi: Sai token header. Chuỗi token không được chứa khoảng trắng

source: Invalid token header. Token string should not contain invalid characters.
vi: Sai token header. Chuỗi token không được chứa ký tự không hợp lệ

source: Invalid token.
vi: Sai token

source: User account is disabled.
vi: Tài khoản người dùng bị khóa

source: Unable to log in with provided credentials.
vi: Không thể đăng nhập với thông tin được cung cấp

source: Must include "username" and "password".
vi: phải chứa cả "username" và "password"

source: A server error occurred.
vi: Máy chủ có lỗi xảy ra

source: Malformed request.
vi: Yêu cầu sai định dạng

source: Incorrect authentication credentials.
vi: Thông tin đăng nhập bị sai

source: Authentication credentials were not provided.
vi: Thông tin đăng nhập không được cung cấp

source: You do not have permission to perform this action.
vi: Bạn không có quyền thực hiện yêu cầu này

source: Not found.
vi: Không tìm thấy

source: Method "{method}" not allowed.
vi: Hàm "{method}" không được phép thực thi.

source: Could not satisfy the request Accept header.
vi: Không thể thỏa mãn header của yêu cầu

source: Unsupported media type "{media_type}" in request.
vi: Yêu cầu có kiểu file "{media_type}" không được hỗ trợ.

source: Request was throttled.
vi: Yêu cầu bị hạn chế do vượt quá tốc độ xử lý máy chủ

source: This field is required.
vi: Trường này không được bỏ trống

source: This field may not be null.
vi: Trường này phải có giá trị.

source: "{input}" is not a valid boolean.
vi: "{input}" không có định dạng đúng hoặc sai.

source: This field may not be blank.
vi: Trường này không được bỏ trống

source: Ensure this field has no more than {max_length} characters.
vi: Đảm bảo rằng trường này không có nhiều hơn {max_length} ký tự.

source: Ensure this field has at least {min_length} characters.
vi: Đảm bảo rằng trường này có ít nhất {min_length} ký tự

source: Enter a valid email address.
vi: Hãy nhập đúng định dạng thư điện tử (email)

source: This value does not match the required pattern.
vi: Giá trị này không khớp với mẫu cho sẵn.

source: Enter a valid "slug" consisting of letters, numbers, underscores or hyphens.
vi: Hãy nhập "slug" hợp lệ chứa chữ cái, số, dấu gạch dưới hoặc dấu phẩy.

source: Enter a valid URL.
vi: Hãy thêm 1 địa chỉ web hợp lệ

source: "{value}" is not a valid UUID.
vi: "{value}" không phải giá trị UUID hợp lệ.

source: Enter a valid IPv4 or IPv6 address.
vi: Hãy nhập 1 địa chỉ IPv4 hoặc IPv6 hợp lệ.

source: A valid integer is required.
vi: Cần nhập 1 số nguyên

source: Ensure this value is less than or equal to {max_value}.
vi: Đảm bảo rằng giá trị này nhỏ hơn hoặc bằng {max_value}.

source: Ensure this value is greater than or equal to {min_value}.
vi: Đảm bảo rằng giá trị này lớn hơn hoặc bằng {min_value}.

source: String value too large.
vi: Chuỗi ký tự này quá lớn.

source: A valid number is required.
vi: Cần nhập 1 chữ số

source: Ensure that there are no more than {max_digits} digits in total.
vi: Đảm bảo rằng tổng số ký tự không nhiều hơn {max_digits}.

source: Ensure that there are no more than {max_decimal_places} decimal places.
vi: Đảm bảo không nhiều hơn {max_decimal_places} chữ số thập phân.

source: Ensure that there are no more than {max_whole_digits} digits before the decimal point.
vi: Đảm bảo không nhiều hơn {max_whole_digits} chữ số trước dấu phẩy.

source: Datetime has wrong format. Use one of these formats instead: {format}.
vi: Giá trị ngày tháng sai định dạng. Dùng 1 trong các định dạng sau: {format}.

source: Expected a datetime but got a date.
vi: Yêu cầu thời gian chính xác đến mức giờ.

source: Date has wrong format. Use one of these formats instead: {format}.
vi: Ngày bị sai định dạng. Dùng 1 trong các định dạng sau: {format}.

source: Expected a date but got a datetime.
vi: Yêu cầu thời gian chính xác đến mức ngày thay vì giờ.

source: Time has wrong format. Use one of these formats instead: {format}.
vi: Thời gian sai định dạng. Dùng 1 trong các định dạng sau: {format}.

source: Duration has wrong format. Use one of these formats instead: {format}.
vi: Khoảng thời gian sai định dạng. Dùng 1 trong các định dạng sau: {format}.

source: "{input}" is not a valid choice.
vi: "{input}" không phải là lựa chọn hợp lệ.

source: More than {count} items...
vi: Nhiều hơn {count} mục...

source: Expected a list of items but got type "{input_type}".
vi: Tưởng được 1 danh sách các mục (list of items) nhưng lại nhận được "{input_type}".

source: This selection may not be empty.
vi: Khoảng chọn này không được để trống.

source: "{input}" is not a valid path choice.
vi: "{input}" không phải là lựa chọn đường dẫn hợp lệ.

source: No file was submitted.
vi: Không nhận được tệp nào.

source: The submitted data was not a file. Check the encoding type on the form.
vi: Dữ liệu gửi lên không phải là tệp. Kiểm tra kiểu encoding của form.

source: No filename could be determined.
vi: Không xác định được tên tệp.

source: The submitted file is empty.
vi: Tệp gửi lên là rỗng.

source: Ensure this filename has at most {max_length} characters (it has {length}).
vi: Đảm bảo tên tệp dài nhất là {max_length} ký tự (nó dài {length}).

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
vi: Hãy tải lên 1 ảnh hợp lệ. Tệp tải lên không phải là ảnh hoặc ảnh đã bị hỏng.

source: This list may not be empty.
vi: Danh sách này không được để trống.

source: Expected a dictionary of items but got type "{input_type}".
vi: Tưởng được 1 từ điển các mục (dictionary of items) nhưng lại được "{input_type}".

source: Value must be valid JSON.
vi: Giá trị phải là 1 JSON hợp lệ.

source: Submit
vi: Gửi lên

source: ascending
vi: tăng dần

source: descending
vi: giảm dần

source: Invalid page.
vi: Trang không hợp lệ.

source: Invalid cursor
vi: Sai con trỏ.

source: Invalid pk "{pk_value}" - object does not exist.
vi: Không có khóa chính "{pk_value}" - đối tượng không tồn tại.

source: Incorrect type. Expected pk value, received {data_type}.
vi: Sai kiểu. Tưởng nhận được khóa chính, nhận được {data_type}.

source: Invalid hyperlink - No URL match.
vi: Sai địa chỉ web. Không khớp.

source: Invalid hyperlink - Incorrect URL match.
vi: Sai địa chỉ web. Không khớp.

source: Invalid hyperlink - Object does not exist.
vi: Sai địa chỉ web. Đối tượng không tồn tại.

source: Incorrect type. Expected URL string, received {data_type}.
vi: Sai kiểu. Tưởng nhận được địa chỉ web, nhận được {data_type}.

source: Object with {slug_name}={value} does not exist.
vi: Đối tượng với {slug_name}={value} không tồn tại.

source: Invalid value.
vi: Giá trị không hợp lệ.

source: Invalid data. Expected a dictionary, but got {datatype}.
vi: Dữ liệu không hợp lệ. Tưởng nhận được từ điển, nhưng nhận được {datatype}.

source: Filters
vi: Lọc

source: Field filters
vi: Lọc theo trường

source: Ordering
vi: Thứ tự

source: Search
vi: Tìm

source: This field must be unique.
vi: Trường này không cho phép được trùng với dữ liệu có sẵn.

source: The fields {field_names} must make a unique set.
vi: Các trường này không cho phép được trùng với dữ liệu có sẵn.

source: This field must be unique for the "{date_field}" date.
vi: Trường này không cho phép được trùng ngày với "{date_field}"

source: This field must be unique for the "{date_field}" month.
vi: Trường này không cho phép được trùng tháng với "{date_field}"

source: This field must be unique for the "{date_field}" year.
vi: Trường này không cho phép được trùng năm với "{date_field}"

source: Invalid version in "Accept" header.
vi: Phiên bản không hợp lệ với header chấp nhận.

source: Invalid version in URL path.
vi: Phiên bản không hợp lệ trong địa chỉ web.

source: Invalid version in URL path. Does not match any version namespace.
vi: Phiên bản không hợp lệ trong địa chỉ web. Không khớp với các phiên bản khác.

source: Invalid version in hostname.
vi: Phiên bản không hợp lệ trong tên host.

source: Invalid version in query parameter.
vi: Phiên bản không hợp lệ trong tham số truy vấn.

source: Permission denied.
vi: Không được cấp phép.
